app/controllers/school_classes_controller.rb

  def update
    respond_to do |format|
      if @school_class.update(school_class_params)
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2017-03-01 18:31:14.984018"], ["id", 1]]