app/controllers/students_controller.rb

UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2017-03-01 19:05:33.424535"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)